# ActSSheet

## Description
Function ActSSheet returns the handle to the currently active worksheet.

```pascal
FUNCTION ActSSheet : HANDLE;
```

```python
def vs.ActSSheet():
    return HANDLE
```

## Remarks
OBSOLETE for Version 9: see new [[VS:GetTopVisibleWS | GetTopVisibleWS]]. [VML 01/09/01]

## See Also
VS Functions:
[GetTopVisibleWS | GetTopVisibleWS](GetTopVisibleWS%20| GetTopVisibleWS.md)

## Version
ActSSheet is obsolete as of VectorWorks 9.0

Availability: from All Versions

## Category
* Worksheets